#### Terraform Plan 📖
```
random_password.grafana_admin: Refreshing state... [id=none]
random_password.keycloak_admin: Refreshing state... [id=none]
aws_acm_certificate.frontend: Refreshing state... [id=arn:aws:acm:us-east-1:283919506801:certificate/a93c5506-175e-49de-bc8e-7c494d2dc5b5]
data.aws_availability_zones.available: Reading...
data.aws_ami.amazon_linux_2023: Reading...
aws_iam_user.github_actions: Refreshing state... [id=monti-github-actions]
aws_ecr_repository.agentsim: Refreshing state... [id=monti-agentsim]
aws_ssm_parameter.keycloak_admin_password: Refreshing state... [id=/monti/keycloak/admin-password]
aws_iam_role.ec2_role: Refreshing state... [id=monti-ec2-role]
aws_ssm_parameter.grafana_admin_password: Refreshing state... [id=/monti/grafana/admin-password]
data.aws_caller_identity.current: Reading...
aws_eip.backend: Refreshing state... [id=eipalloc-0cac1d5c38cb76ec8]
data.aws_route53_zone.main: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=283919506801]
aws_s3_bucket.frontend: Refreshing state... [id=monti-frontend]
aws_ecr_repository.backend: Refreshing state... [id=monti-backend]
data.aws_route53_zone.main: Read complete after 1s [id=Z04643811HIYSAM5J8YGX]
aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E3SN1HM0QDWQ98]
data.aws_vpc.default: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=eu-central-1]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAUEGXL3VYZ3PPXAXB]
aws_route53_record.frontend_cert_validation["monti.dennisdiepolder.com"]: Refreshing state... [id=Z04643811HIYSAM5J8YGX__40cc0ccee286596f6f5a1dd8d5cdb098.monti.dennisdiepolder.com._CNAME]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=monti-ec2-profile]
aws_iam_role_policy.ssm_policy: Refreshing state... [id=monti-ec2-role:monti-ssm-policy]
aws_iam_role_policy.ecr_policy: Refreshing state... [id=monti-ec2-role:monti-ecr-policy]
aws_ecr_lifecycle_policy.agentsim: Refreshing state... [id=monti-agentsim]
aws_route53_record.backend: Refreshing state... [id=Z04643811HIYSAM5J8YGX_montibackend.dennisdiepolder.com_A]
aws_route53_record.grafana: Refreshing state... [id=Z04643811HIYSAM5J8YGX_monti-grafana.dennisdiepolder.com_A]
aws_iam_user_policy.ecr_policy: Refreshing state... [id=monti-github-actions:monti-cicd-ecr]
aws_ecr_lifecycle_policy.backend: Refreshing state... [id=monti-backend]
aws_acm_certificate_validation.frontend: Refreshing state... [id=2026-01-27 10:53:25.575 +0000 UTC]
data.aws_ami.amazon_linux_2023: Read complete after 2s [id=ami-09107745315e0d79a]
data.aws_vpc.default: Read complete after 1s [id=vpc-0de0f6f2dc04e2d60]
aws_security_group.backend: Refreshing state... [id=sg-0cb27c70a2ce0c3a7]
aws_instance.backend: Refreshing state... [id=i-01b85e089462de008]
aws_iam_user_policy.s3_policy: Refreshing state... [id=monti-github-actions:monti-cicd-s3]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=monti-frontend]
aws_s3_bucket_versioning.frontend: Refreshing state... [id=monti-frontend]
aws_cloudfront_distribution.frontend: Refreshing state... [id=E2IWUI1W1OUXHT]
aws_s3_bucket_policy.frontend: Refreshing state... [id=monti-frontend]
aws_iam_user_policy.cloudfront_policy: Refreshing state... [id=monti-github-actions:monti-cicd-cloudfront]
aws_route53_record.frontend: Refreshing state... [id=Z04643811HIYSAM5J8YGX_monti.dennisdiepolder.com_A]
aws_eip_association.backend: Refreshing state... [id=eipassoc-0acc3bb142c57a0e4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.agent_daily_stats will be created
  + resource "aws_dynamodb_table" "agent_daily_stats" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "AgentID"
      + id               = (known after apply)
      + name             = "monti-agent-daily-stats"
      + range_key        = "Date"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "monti-agent-daily-stats"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monti-agent-daily-stats"
          + "Project"     = "MONTI"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "AgentID"
          + type = "S"
        }
      + attribute {
          + name = "Date"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table.call_records will be created
  + resource "aws_dynamodb_table" "call_records" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "DateKey"
      + id               = (known after apply)
      + name             = "monti-call-records"
      + range_key        = "CallID"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "monti-call-records"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "monti-call-records"
          + "Project"     = "MONTI"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "CallID"
          + type = "S"
        }
      + attribute {
          + name = "DateKey"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_iam_role_policy.dynamodb_policy will be created
  + resource "aws_iam_role_policy" "dynamodb_policy" {
      + id          = (known after apply)
      + name        = "monti-dynamodb-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:eu-central-1:283919506801:table/monti-*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "monti-ec2-role"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```
*Triggered by @dyprodg*